Repository: julianfaalk/workout-ios
Catalog: REPS/Localizable.xcstrings
Source language: en
Languages: ar, de, es, hi, zh_hans

# profile.delete.message
source: This removes your Workout Cloud account and server-side profile data. Local workout data on this iPhone remains until you reset the database.
ar: سيؤدي هذا إلى حذف حساب Workout Cloud وبيانات الملف الشخصي على الخادم. ستبقى بيانات التمرين المحلية على هذا iPhone حتى تعيد تعيين قاعدة البيانات.
de: Damit loeschst du deinen Workout-Cloud-Account und alle serverseitigen Profildaten. Lokale Trainingsdaten auf diesem iPhone bleiben bestehen, bis du die Datenbank zuruecksetzt.
es: Esto elimina tu cuenta de Workout Cloud y tus datos de perfil del servidor. Los datos locales del iPhone se quedan hasta que restablezcas la base de datos.
hi: यह आपके Workout Cloud अकाउंट और सर्वर प्रोफाइल डेटा को हटा देगा। इस iPhone का लोकल वर्कआउट डेटा तब तक रहेगा जब तक आप डेटाबेस रीसेट नहीं करते।
zh_hans: 这会删除你的 Workout Cloud 账号和服务器端资料数据。本机训练数据会保留，直到你重置数据库。

# profile.delete.title
source: Delete Cloud Account?
ar: حذف حساب السحابة؟
de: Cloud-Account loeschen?
es: ¿Eliminar cuenta cloud?
hi: क्लाउड अकाउंट हटाएं?
zh_hans: 删除云账户？

# profile.exercise_library
source: Exercise Library
ar: مكتبة التمارين
es: Biblioteca de ejercicios
hi: एक्सरसाइज़ लाइब्रेरी
zh_hans: 动作库

# profile.export.format
source: Export Format
ar: تنسيق التصدير
es: Formato de exportacion
hi: एक्सपोर्ट फॉर्मेट
zh_hans: 导出格式

# profile.export.success
source: Export successful.
ar: تم التصدير بنجاح.
de: Export erfolgreich.
es: Exportacion correcta.
hi: एक्सपोर्ट सफल रहा।
zh_hans: 导出成功。

# profile.language
source: Language
ar: اللغة
de: Sprache
es: Idioma
hi: भाषा
zh_hans: 语言

# profile.notifications.motivation
source: Motivation & streaks
ar: تحفيز وسلسلة
es: Motivacion y rachas
hi: मोटिवेशन और स्ट्रीक
zh_hans: 动力与连续记录

# profile.notifications.quiet_end
source: Quiet hours end
ar: انتهاء الهدوء
de: Quiet Hours Ende
es: Fin del silencio
hi: क्वाइट आवर्स समाप्त
zh_hans: 安静时段结束

# profile.notifications.quiet_start
source: Quiet hours start
ar: بداية الهدوء
es: Inicio del silencio
hi: क्वाइट आवर्स शुरू
zh_hans: 安静时段开始

# profile.notifications.reminder_time
source: Reminder Time
ar: وقت التذكير
de: Erinnerungszeit
es: Hora del recordatorio
hi: रिमाइंडर समय
zh_hans: 提醒时间

# profile.notifications.rest_haptic
source: Rest Timer Haptic
ar: اهتزاز مؤقت الراحة
de: Rest-Timer Haptik
es: Vibracion del descanso
hi: रेस्ट टाइमर हैप्टिक
zh_hans: 休息计时震动

# profile.notifications.rest_sound
source: Rest Timer Sound
ar: صوت مؤقت الراحة
es: Sonido del descanso
hi: रेस्ट टाइमर साउंड
zh_hans: 休息计时声音

# profile.notifications.section
source: Notifications
ar: الإشعارات
de: Benachrichtigungen
es: Notificaciones
hi: नोटिफिकेशन
zh_hans: 通知

# profile.notifications.social
source: Friends & leaderboard
ar: الأصدقاء ولوحة الترتيب
es: Amigos y clasificacion
hi: दोस्त और लीडरबोर्ड
zh_hans: 好友与排行榜

# profile.notifications.workout_reminders
source: Workout Reminders
ar: تذكيرات التمرين
de: Workout-Reminder
es: Recordatorios de entrenamiento
hi: वर्कआउट रिमाइंडर
zh_hans: 训练提醒

# profile.premium.restore
source: Restore Purchases
ar: استعادة المشتريات
de: Kaeufe wiederherstellen
es: Restaurar compras
hi: खरीदारी बहाल करें
zh_hans: 恢复购买

# profile.reset.confirm
source: Reset
ar: إعادة تعيين
de: Zuruecksetzen
es: Restablecer
hi: रीसेट
zh_hans: 重置

# profile.reset.message
source: This will delete all data and restore default templates and schedule. This cannot be undone.
ar: سيؤدي هذا إلى حذف جميع البيانات واستعادة القوالب والجدول الافتراضيين. لا يمكن التراجع عن ذلك.
de: Das loescht alle Daten und stellt Default-Templates und Schedule wieder her. Das kann nicht rueckgaengig gemacht werden.
es: Esto borrara todos los datos y restaurara plantillas y calendario por defecto. No se puede deshacer.
hi: यह सभी डेटा हटाकर डिफॉल्ट टेम्पलेट और शेड्यूल वापस लाएगा। इसे वापस नहीं किया जा सकता।
zh_hans: 这会删除所有数据并恢复默认模板和日程，且无法撤销。

# profile.reset.success
source: Database reset successfully.
ar: تمت إعادة التعيين بنجاح.
de: Datenbank erfolgreich zurueckgesetzt.
es: Base de datos restablecida.
hi: डेटाबेस सफलतापूर्वक रीसेट हुआ।
zh_hans: 数据库已成功重置。

# profile.reset.title
source: Reset Database?
ar: إعادة تعيين قاعدة البيانات؟
de: Datenbank zuruecksetzen?
es: ¿Restablecer base de datos?
hi: डेटाबेस रीसेट करें?
zh_hans: 重置数据库？

# profile.section
source: Profile
ar: الملف الشخصي
de: Profil
es: Perfil
hi: प्रोफाइल
zh_hans: 个人资料

# profile.sign_out
source: Sign Out
ar: تسجيل الخروج
es: Cerrar sesion
hi: साइन आउट
zh_hans: 退出登录

# profile.status.free
source: Free
ar: مجاني
es: Gratis
hi: फ्री
zh_hans: 免费

# profile.storage.copy
source: Workouts stay local on your device. Workout Cloud stores your account, premium state and key progress metrics long term.
ar: تبقى التمارين محلية على جهازك. تحفظ Workout Cloud الحساب والحالة المميزة وأهم مؤشرات التقدم بشكل دائم.
de: Workouts bleiben lokal auf deinem Geraet. Workout Cloud speichert Konto, Premium-Status und die wichtigsten Fortschrittskennzahlen dauerhaft.
es: Los workouts se quedan en tu dispositivo. Workout Cloud guarda tu cuenta, premium y metricas clave a largo plazo.
hi: वर्कआउट आपके डिवाइस पर लोकल रहते हैं। Workout Cloud आपका अकाउंट, प्रीमियम स्टेटस और मुख्य प्रोग्रेस मेट्रिक्स सेव करता है।
zh_hans: 训练数据保留在本机，Workout Cloud 长期保存你的账户、会员状态和关键进度指标。

# profile.success.operation
source: Operation completed successfully.
ar: اكتملت العملية بنجاح.
de: Vorgang erfolgreich abgeschlossen.
es: Operacion completada.
hi: ऑपरेशन सफलतापूर्वक पूरा हुआ।
zh_hans: 操作已成功完成。

# profile.timers.default_rest
source: Default Rest Time
ar: وقت الراحة الافتراضي
es: Descanso por defecto
hi: डिफॉल्ट रेस्ट टाइम
zh_hans: 默认休息时间

# profile.timers.section
source: Timers
ar: المؤقتات
de: Timer
es: Temporizadores
hi: टाइमर
zh_hans: 计时器

# rotation.style.balanced.subtitle
source: Mix steady progression with fresh exercise changes.
ar: يمزج التقدم الثابت مع تغييرات ذكية ومنعشة.
de: Mischt konstante Progression mit frischen Exercise-Wechseln.
es: Mezcla progresion estable con cambios frescos.
hi: स्थिर प्रोग्रेशन को नए exercise changes के साथ मिलाओ।
zh_hans: 在稳定进步和新鲜变化之间保持平衡。

# rotation.style.balanced.title
source: Balanced
ar: متوازن
hi: बैलेंस्ड
zh_hans: 平衡

# rotation.style.fresh.subtitle
source: Rotate more often for maximum variety.
ar: يدور بشكل اسرع لاقصى تنوع.
de: Rotiert oefter fuer maximale Abwechslung.
es: Rota mas seguido para maxima variedad.
hi: ज्यादा variety के लिए जल्दी-जल्दी rotate करो।
zh_hans: 更频繁轮换，保持最大新鲜感。

# rotation.style.fresh.title
source: Fresh
ar: متجدد
hi: फ्रेश
zh_hans: 新鲜

# rotation.style.stable.subtitle
source: Keep assistance work steady so progress stays measurable.
ar: يبقي تمارين المساعدة ثابتة حتى يبقى التقدم قابلاً للقياس.
de: Haelt Assistenz-Uebungen stabil, damit Fortschritt messbar bleibt.
es: Mantiene ejercicios estables para medir mejor el progreso.
hi: असिस्टेंस वर्क स्थिर रखो ताकि प्रोग्रेस measurable रहे।
zh_hans: 保持辅助动作稳定，让进步更容易衡量。

# rotation.style.stable.title
source: Stable
ar: ثابت
hi: स्टेबल
zh_hans: 稳定

# tab.friends
source: Friends
ar: الأصدقاء
de: Freunde
hi: दोस्त
zh_hans: 好友

# tab.profile
source: Profile
ar: الملف
de: Profil
es: Perfil
hi: प्रोफाइल
zh_hans: 资料

# tab.progress
source: Progress
ar: التقدم
de: Fortschritt
es: Progreso
hi: प्रगति
zh_hans: 进度

# tab.schedule
source: Schedule
ar: الخطة
de: Plan
es: Plan
hi: शेड्यूल
zh_hans: 计划

# tab.today
source: Today
ar: اليوم
de: Heute
es: Hoy
hi: आज
zh_hans: 今天

# wizard.finish
source: Enter the app
ar: إلى التطبيق
de: Weiter zur App
es: Entrar a la app
hi: ऐप में जाएँ
zh_hans: 进入应用

# wizard.focus
source: What should the app optimize for?
ar: على ماذا يجب أن تركز؟
de: Worauf soll die App optimieren?
es: ¿Que debe optimizar la app?
hi: ऐप किस पर ऑप्टिमाइज़ करे?
zh_hans: 应用应该优先优化什么？

# wizard.goal
source: Goal
ar: الهدف
de: Trainingsziel
es: Objetivo
hi: लक्ष्य
zh_hans: 目标

# wizard.goal.placeholder
source: Build muscle, lose fat, stay consistent...
ar: بناء عضل، خسارة دهون، روتين...
de: Muskelaufbau, Fettverlust, Routine ...
es: Musculo, grasa, rutina...
hi: मसल, फैट लॉस, रूटीन...
zh_hans: 增肌、减脂、建立习惯...

# wizard.level
source: Level
ar: المستوى
es: Nivel
hi: लेवल
zh_hans: 水平

# wizard.level.advanced
source: Advanced
ar: متقدم
de: Fortgeschritten
es: Avanzado
hi: एडवांस्ड
zh_hans: 高级

# wizard.level.beginner
source: Beginner
ar: مبتدئ
de: Anfaenger
es: Principiante
hi: बिगिनर
zh_hans: 新手

# wizard.level.intermediate
source: Intermediate
ar: متوسط
es: Intermedio
hi: इंटरमीडिएट
zh_hans: 中级

# wizard.name
source: Name
ar: الاسم
es: Nombre
hi: नाम
zh_hans: 名字

# wizard.notifications.copy
source: Sends local reminders for your planned training days.
ar: يرسل لك تذكيرات محلية لأيام التدريب المخططة.
de: Schickt dir lokale Notifications fuer deine geplanten Trainingstage.
es: Te envia recordatorios locales para tus dias planeados.
hi: तुम्हारे प्लान किए गए दिनों के लिए लोकल रिमाइंडर भेजता है।
zh_hans: 为你的计划训练日发送本地提醒。

# wizard.notifications.denied
source: Notifications are not allowed right now. REPS will keep going and you can enable reminders later in Settings.
ar: الاشعارات غير مسموح بها الآن. ستكمل REPS ويمكنك تفعيل التذكيرات لاحقًا من الاعدادات.
de: Mitteilungen sind aktuell nicht erlaubt. REPS laeuft trotzdem weiter und du kannst Reminder spaeter in den Einstellungen aktivieren.
es: Las notificaciones no estan permitidas ahora. REPS seguira y podras activarlas luego en Ajustes.
hi: अभी नोटिफिकेशन की अनुमति नहीं है। REPS चलता रहेगा और तुम बाद में Settings में reminders चालू कर सकते हो।
zh_hans: 当前没有通知权限。REPS 仍会继续运行，你可以稍后在设置中开启提醒。

# wizard.notifications.enable
source: Enable workout reminders
ar: تفعيل التذكيرات
de: Workout-Reminder aktivieren
es: Activar recordatorios
hi: वर्कआउट रिमाइंडर चालू करें
zh_hans: 开启训练提醒

# wizard.notifications.time
source: Reminder time
ar: وقت التذكير
de: Reminder-Zeit
es: Hora del recordatorio
hi: रिमाइंडर समय
zh_hans: 提醒时间

# wizard.profile.name_required
source: Please enter a name for your profile.
ar: يرجى إدخال اسم لملفك الشخصي.
de: Bitte gib einen Namen fuer dein Profil ein.
es: Introduce un nombre para tu perfil.
hi: कृपया अपने प्रोफाइल के लिए नाम दर्ज करें।
zh_hans: 请输入你的资料名称。

# wizard.review_plan
source: Review my plan
ar: راجع خطتي
de: Meinen Plan ansehen
es: Revisar mi plan
hi: मेरा प्लान देखो
zh_hans: 查看我的计划

# wizard.rotation
source: How fresh should the exercise rotation feel?
ar: كم يجب أن تتغير التمارين؟
de: Wie frisch sollen die Uebungen rotieren?
es: ¿Cuanto debe rotar el plan?
hi: एक्सरसाइज़ कितनी ताज़ा बदलनी चाहिए?
zh_hans: 动作轮换要多频繁？

# wizard.saving
source: Saving setup...
ar: يتم حفظ الإعداد...
de: Setup wird gespeichert ...
es: Guardando setup...
hi: सेटअप सेव हो रहा है...
zh_hans: 正在保存设置...

# wizard.session_length
source: Planned session length
ar: مدة الجلسة
de: Geplante Session-Laenge
es: Duracion prevista
hi: सेशन की लंबाई
zh_hans: 计划训练时长

# wizard.session_length.caption
source: Short to focused long
ar: قصير حتى مركز طويل
de: Kurz bis fokussiert lang
es: Corto hasta largo enfocado
hi: छोटे से फोकस्ड लंबे तक
zh_hans: 从短时到高专注长时

# wizard.step.focus
source: Training focus
ar: التركيز
de: Trainings-Fokus
es: Foco
hi: फोकस
zh_hans: 训练重点

# wizard.step.notifications
source: Notifications
ar: الإشعارات
de: Rotation & Reminder
es: Notificaciones
hi: नोटिफिकेशन
zh_hans: 通知

# wizard.step.profile
source: Profile
ar: الملف
de: Profil
es: Perfil
hi: प्रोफाइल
zh_hans: 资料

# wizard.subtitle
source: We set up your training profile once, so new accounts start with focus, rotation and reminders.
ar: سنجهز لك إعداد التدريب من البداية مع التركيز والتذكيرات.
de: Wir bauen dir einmal sauber dein Trainings-Setup. Neue Konten bekommen damit direkt Rotation, Reminder und einen klaren Fokus fuer den Start.
es: Montamos tu setup una vez para que empieces con foco y recordatorios.
hi: हम तुम्हारा ट्रेनिंग सेटअप शुरू में साफ़ तरीके से तैयार करते हैं।
zh_hans: 我们会一次性帮你配置训练画像，让你从一开始就有清晰重点与提醒。

# wizard.title
source: Set up your profile
ar: جهّز ملفك
de: Mach dein Profil startklar
es: Prepara tu perfil
hi: अपना प्रोफाइल तैयार करो
zh_hans: 准备好你的资料

# wizard.training_days
source: Training days per week
ar: أيام التدريب بالأسبوع
de: Trainings-Tage pro Woche
es: Dias por semana
hi: प्रति सप्ताह ट्रेनिंग दिन
zh_hans: 每周训练天数

# wizard.training_days.caption
source: Keeps goals and calendar aligned
ar: ليطابق الأهداف والتقويم
de: Damit Goals und Calendar dazu passen
es: Para alinear metas y calendario
hi: ताकि लक्ष्य और कैलेंडर साथ रहें
zh_hans: 让目标与日历保持一致

# wizard.training_days.value
source: %d days
ar: %d أيام
de: %d Tage
es: %d dias
hi: %d दिन
zh_hans: %d 天

# auth.email.placeholder
source: you@example.com
de: deine@email.de
es: tu@email.com
hi: aap@email.com

# plan.style.push_pull
source: Push / Pull Split
es: Split Push / Pull
zh_hans: Push / Pull 分化

# plan.style.push_pull_legs_shoulders
source: Push / Pull / Legs / Shoulders
es: Push / Pull / Legs / Hombros
